Basics/volatile/volatile.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-13 Mon 14:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Volatile Keyword in C/C++</title>
<meta name="author" content="dclinee" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Volatile Keyword in C/C++</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgad166fd">1. Syntax:</a></li>
<li><a href="#org0d9d003">2. Example:</a></li>
<li><a href="#orgc940221">3. Simple example</a></li>
<li><a href="#orgf575280">4. Real life use of volatile</a></li>
</ul>
</div>
</div>
<p>
Volatile in C/C++ programming language is a keyword which is used with variables to
inform the compiler not to apply any optimizations to code dealing with the variable.
This is used to avoid some assumptions that go into compiler optimizations which
can break the code. This is mainly used in Embedded System programming and real time
systems.
</p>

<div id="outline-container-orgad166fd" class="outline-2">
<h2 id="orgad166fd"><span class="section-number-2">1.</span> Syntax:</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #b9ca4a;">volatile</span> &lt;data_type&gt; &lt;variable_name&gt;;
<span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">or</span>
&lt;data_type&gt; <span style="color: #b9ca4a;">volatile</span> &lt;variable_name&gt;;
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d9d003" class="outline-2">
<h2 id="org0d9d003"><span class="section-number-2">2.</span> Example:</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #b9ca4a;">volatile</span> <span style="color: #7aa6da;">int</span> <span style="color: #e7c547;">some_variable</span> = 1;
<span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">or</span>
<span style="color: #7aa6da;">int</span> <span style="color: #b9ca4a;">volatile</span> <span style="color: #e7c547;">other_variable</span> = 100;
</pre>
</div>

<p>
As a general rule, all variables whose value can change suddenly due to an external
reason (like an external device or another program thread) should be declared using
volatile.
</p>

<p>
Note that unnecessarily using volatile for all keywors will reduce performance and
not using it when required will result in unexpected execution result.
</p>

<p>
Compiler optimizations include:
</p>

<p>
. caching variables
. skip checking loop termination conditions or doing it at compile time only
. pre-determining the conditional program path
</p>

<p>
and many more. Volatile is the approach to keep the perfect balance between program
correctness and performance.
</p>
</div>
</div>

<div id="outline-container-orgc940221" class="outline-2">
<h2 id="orgc940221"><span class="section-number-2">3.</span> Simple example</h2>
<div class="outline-text-2" id="text-3">
<p>
To understand the importance of volatile in C/C++, let us consider a simple example
(main.c) as below:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #c397d8;">#include</span> <span style="color: #eaeaea;">&lt;</span><span style="color: #70c0b1;">stdio.h</span><span style="color: #eaeaea;">&gt;</span>
<span style="color: #c397d8;">#include</span> <span style="color: #70c0b1;">"other_header.h"</span>

<span style="color: #7aa6da;">int</span> <span style="color: #e78c45;">main</span><span style="color: #eaeaea;">(</span><span style="color: #7aa6da;">void</span><span style="color: #eaeaea;">)</span>
  <span style="color: #eaeaea;">{</span>
    <span style="color: #b9ca4a;">while</span><span style="color: #70c0b1;">(</span>some_variable<span style="color: #70c0b1;">)</span>
      <span style="color: #70c0b1;">{}</span>;    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">infinite loop</span>
  <span style="color: #eaeaea;">}</span>
</pre>
</div>

<p>
We will have a header file other<sub>header.h</sub> as:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #b9ca4a;">extern</span> <span style="color: #7aa6da;">int</span> <span style="color: #e7c547;">some_variable</span>;
</pre>
</div>

<p>
We will have a common file name test.c to declare some<sub>variable</sub> as:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #c397d8;">#include</span> <span style="color: #70c0b1;">"other_header.h"</span>
<span style="color: #7aa6da;">int</span> <span style="color: #e7c547;">some_variable</span> = 1;
</pre>
</div>

<p>
Now, if we compile and execute main.c by linking it with test.c, it will fall into
a infinite loop.
</p>

<div class="org-src-container">
<pre class="src src-sh">gcc main.c test.c
./a.out
</pre>
</div>

<p>
This is only because of compiler optimizations.
</p>

<p>
Our compiler(GNU GCC) will think intelligently and see that the value of some<sub>variable</sub>
variable is 1 and will avoid all other checks for the while loop and get into an
infinite loop.
</p>

<p>
The problem is that the value of some<sub>variable</sub> can get changed inbetween and this will
allow the while loop to break but as the compiler has optimized the code to check the value
of some<sub>variable</sub> only once and at the beginning, it will never reach the condition to
get out of the loop.
</p>

<p>
To prevent this, there are two options:
. turn off all compiler optimizations
. turn off compiler optimizations only for required code sections
</p>

<p>
Turning off all compiler optimizations will greatly impact the overall performancw and
hence, the better approach is to turn off optimizations for specific code sections.
</p>

<p>
To solve this, we need to modify test.c as:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #c397d8;">#include</span> <span style="color: #70c0b1;">"other_header.h"</span>
<span style="color: #b9ca4a;">volatile</span> <span style="color: #7aa6da;">int</span> <span style="color: #e7c547;">some_variable</span> = 1;
</pre>
</div>

<p>
Now, if we execute another thread in parallel to modify the value of some<sub>variable</sub>
variable to 0, the while loop will be stopped.
</p>
</div>
</div>

<div id="outline-container-orgf575280" class="outline-2">
<h2 id="orgf575280"><span class="section-number-2">4.</span> Real life use of volatile</h2>
<div class="outline-text-2" id="text-4">
<p>
Variables should be declared volatile if its value can be changed asynchronously.
Such situations include:
. variables representing device or peripheral registers. Devides can get disconnected
  or damaged anytime.
. variables whose value is changed by a system call like interrupt service routine
. global variabls
. program is not thread sage
. variables which are accessed in multiple threads
</p>

<p>
Note that volatile should not be used as a synchronization method.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-03-10 Fri 00:00</p>
<p class="author">Author: dclinee</p>
<p class="date">Created: 2023-03-13 Mon 14:57</p>
</div>
</body>
</html>
